

# атрибути доступу:
# r - для читання
# w - для перезапису
# a - для дозапису


# Приклад створення вспливаючого вікна про помилку:
QMessageBox.warning(self, "Помилка", "Назва замітки не може бути порожньою!")
# "Помилка" - назва вспливаючого вікна
# "Назва замітки не може бути порожньою!" - текст у вспливаючому вікні


# Приклад підключення функції до кнопки
self.назва_кнопки.clicked.connect(self.функція) 


# Приклад очищення вмістимості віджета
self.назва_віджета.clear() 


# Приклад перевірки обраних елементів:
if self.назва_віджета.selectedItems()


# Приклад показу та приховання вікон
назва_вікна.show()
назва_вікна.hide()
